; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l36_p36_c36_g36)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 refugio26 refugio27 refugio28 refugio29 refugio30 refugio31 refugio32 refugio33 refugio34 refugio35 refugio36 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 person26 person27 person28 person29 person30 person31 person32 person33 person34 person35 person36 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 comida)
	(at-box box16 deposito)
	(box-has box16 comida)
	(at-box box17 deposito)
	(box-has box17 comida)
	(at-box box18 deposito)
	(box-has box18 comida)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-box box26 deposito)
	(box-has box26 medicina)
	(at-box box27 deposito)
	(box-has box27 medicina)
	(at-box box28 deposito)
	(box-has box28 medicina)
	(at-box box29 deposito)
	(box-has box29 medicina)
	(at-box box30 deposito)
	(box-has box30 medicina)
	(at-box box31 deposito)
	(box-has box31 medicina)
	(at-box box32 deposito)
	(box-has box32 medicina)
	(at-box box33 deposito)
	(box-has box33 medicina)
	(at-box box34 deposito)
	(box-has box34 medicina)
	(at-box box35 deposito)
	(box-has box35 medicina)
	(at-box box36 deposito)
	(box-has box36 medicina)
	(at-person person1 refugio3)
	(at-person person2 refugio7)
	(at-person person3 refugio20)
	(at-person person4 refugio18)
	(at-person person5 refugio9)
	(at-person person6 refugio27)
	(at-person person7 refugio34)
	(at-person person8 refugio3)
	(at-person person9 refugio31)
	(at-person person10 refugio6)
	(at-person person11 refugio34)
	(at-person person12 refugio19)
	(at-person person13 refugio17)
	(at-person person14 refugio5)
	(at-person person15 refugio7)
	(at-person person16 refugio33)
	(at-person person17 refugio4)
	(at-person person18 refugio16)
	(at-person person19 refugio16)
	(at-person person20 refugio4)
	(at-person person21 refugio23)
	(at-person person22 refugio3)
	(at-person person23 refugio8)
	(at-person person24 refugio19)
	(at-person person25 refugio21)
	(at-person person26 refugio8)
	(at-person person27 refugio18)
	(at-person person28 refugio27)
	(at-person person29 refugio31)
	(at-person person30 refugio8)
	(at-person person31 refugio1)
	(at-person person32 refugio21)
	(at-person person33 refugio24)
	(at-person person34 refugio24)
	(at-person person35 refugio23)
	(at-person person36 refugio12)
)

(:goal (and
	(person-has person1 comida)
	(person-has person1 medicina)
	(person-has person2 comida)
	(person-has person4 medicina)
	(person-has person5 comida)
	(person-has person5 medicina)
	(person-has person6 comida)
	(person-has person6 medicina)
	(person-has person7 comida)
	(person-has person8 comida)
	(person-has person8 medicina)
	(person-has person9 medicina)
	(person-has person10 medicina)
	(person-has person11 comida)
	(person-has person12 medicina)
	(person-has person13 medicina)
	(person-has person14 medicina)
	(person-has person15 comida)
	(person-has person15 medicina)
	(person-has person16 comida)
	(person-has person16 medicina)
	(person-has person17 comida)
	(person-has person18 medicina)
	(person-has person21 comida)
	(person-has person21 medicina)
	(person-has person22 comida)
	(person-has person22 medicina)
	(person-has person23 medicina)
	(person-has person24 comida)
	(person-has person25 comida)
	(person-has person26 comida)
	(person-has person26 medicina)
	(person-has person27 comida)
	(person-has person30 comida)
	(person-has person30 medicina)
	(person-has person35 comida)
))
)

; plan
1. (pick box36 deposito dron1-der dron1)
   deleted: (at-box box36 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box36)
   goals met: 0 of 36
2. (pick box18 deposito dron1-izq dron1)
   deleted: (at-box box18 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box18)
   goals met: 0 of 36
3. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 0 of 36
4. (move refugio9 refugio31 dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 refugio31)
   goals met: 0 of 36
5. (leave box36 refugio31 dron1-der dron1 person9 medicina)
   deleted: (carrying dron1 dron1-der box36) (box-has box36 medicina)
   added: (at-box box36 refugio31) (free dron1-der) (person-has person9 medicina)
   goals met: 1 of 36
6. (move refugio31 deposito dron1)
   deleted: (at-dron dron1 refugio31)
   added: (at-dron dron1 deposito)
   goals met: 1 of 36
7. (pick box35 deposito dron1-der dron1)
   deleted: (at-box box35 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box35)
   goals met: 1 of 36
8. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 1 of 36
9. (move refugio9 refugio6 dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 refugio6)
   goals met: 1 of 36
10. (leave box35 refugio6 dron1-der dron1 person10 medicina)
   deleted: (carrying dron1 dron1-der box35) (box-has box35 medicina)
   added: (at-box box35 refugio6) (free dron1-der) (person-has person10 medicina)
   goals met: 2 of 36
11. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 2 of 36
12. (pick box34 deposito dron1-der dron1)
   deleted: (at-box box34 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box34)
   goals met: 2 of 36
13. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 2 of 36
14. (move refugio9 refugio17 dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 refugio17)
   goals met: 2 of 36
15. (leave box34 refugio17 dron1-der dron1 person13 medicina)
   deleted: (carrying dron1 dron1-der box34) (box-has box34 medicina)
   added: (at-box box34 refugio17) (free dron1-der) (person-has person13 medicina)
   goals met: 3 of 36
16. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 3 of 36
17. (pick box33 deposito dron1-der dron1)
   deleted: (at-box box33 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box33)
   goals met: 3 of 36
18. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 3 of 36
19. (move refugio9 refugio5 dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 refugio5)
   goals met: 3 of 36
20. (leave box33 refugio5 dron1-der dron1 person14 medicina)
   deleted: (carrying dron1 dron1-der box33) (box-has box33 medicina)
   added: (at-box box33 refugio5) (free dron1-der) (person-has person14 medicina)
   goals met: 4 of 36
21. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 4 of 36
22. (pick box32 deposito dron1-der dron1)
   deleted: (at-box box32 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box32)
   goals met: 4 of 36
23. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 4 of 36
24. (move refugio9 refugio4 dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 refugio4)
   goals met: 4 of 36
25. (leave box18 refugio4 dron1-izq dron1 person17 comida)
   deleted: (carrying dron1 dron1-izq box18) (box-has box18 comida)
   added: (at-box box18 refugio4) (free dron1-izq) (person-has person17 comida)
   goals met: 5 of 36
26. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 5 of 36
27. (pick box17 deposito dron1-izq dron1)
   deleted: (at-box box17 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box17)
   goals met: 5 of 36
28. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 5 of 36
29. (move refugio9 refugio16 dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 refugio16)
   goals met: 5 of 36
30. (leave box32 refugio16 dron1-der dron1 person18 medicina)
   deleted: (carrying dron1 dron1-der box32) (box-has box32 medicina)
   added: (at-box box32 refugio16) (free dron1-der) (person-has person18 medicina)
   goals met: 6 of 36
31. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 6 of 36
32. (pick box31 deposito dron1-der dron1)
   deleted: (at-box box31 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box31)
   goals met: 6 of 36
33. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 6 of 36
34. (move refugio9 refugio21 dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 refugio21)
   goals met: 6 of 36
35. (leave box17 refugio21 dron1-izq dron1 person25 comida)
   deleted: (carrying dron1 dron1-izq box17) (box-has box17 comida)
   added: (at-box box17 refugio21) (free dron1-izq) (person-has person25 comida)
   goals met: 7 of 36
36. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 7 of 36
37. (pick box16 deposito dron1-izq dron1)
   deleted: (at-box box16 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box16)
   goals met: 7 of 36
38. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 7 of 36
39. (leave box16 refugio9 dron1-izq dron1 person5 comida)
   deleted: (carrying dron1 dron1-izq box16) (box-has box16 comida)
   added: (at-box box16 refugio9) (free dron1-izq) (person-has person5 comida)
   goals met: 8 of 36
40. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 8 of 36
41. (pick box15 deposito dron1-izq dron1)
   deleted: (at-box box15 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box15)
   goals met: 8 of 36
42. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 8 of 36
43. (leave box31 refugio9 dron1-der dron1 person5 medicina)
   deleted: (carrying dron1 dron1-der box31) (box-has box31 medicina)
   added: (at-box box31 refugio9) (free dron1-der) (person-has person5 medicina)
   goals met: 9 of 36
44. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 9 of 36
45. (pick box30 deposito dron1-der dron1)
   deleted: (at-box box30 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box30)
   goals met: 9 of 36
46. (move deposito refugio27 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio27)
   goals met: 9 of 36
47. (leave box15 refugio27 dron1-izq dron1 person6 comida)
   deleted: (carrying dron1 dron1-izq box15) (box-has box15 comida)
   added: (at-box box15 refugio27) (free dron1-izq) (person-has person6 comida)
   goals met: 10 of 36
48. (move refugio27 deposito dron1)
   deleted: (at-dron dron1 refugio27)
   added: (at-dron dron1 deposito)
   goals met: 10 of 36
49. (pick box14 deposito dron1-izq dron1)
   deleted: (at-box box14 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box14)
   goals met: 10 of 36
50. (move deposito refugio27 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio27)
   goals met: 10 of 36
51. (leave box30 refugio27 dron1-der dron1 person6 medicina)
   deleted: (carrying dron1 dron1-der box30) (box-has box30 medicina)
   added: (at-box box30 refugio27) (free dron1-der) (person-has person6 medicina)
   goals met: 11 of 36
52. (move refugio27 deposito dron1)
   deleted: (at-dron dron1 refugio27)
   added: (at-dron dron1 deposito)
   goals met: 11 of 36
53. (pick box29 deposito dron1-der dron1)
   deleted: (at-box box29 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box29)
   goals met: 11 of 36
54. (move deposito refugio34 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio34)
   goals met: 11 of 36
55. (leave box14 refugio34 dron1-izq dron1 person7 comida)
   deleted: (carrying dron1 dron1-izq box14) (box-has box14 comida)
   added: (at-box box14 refugio34) (free dron1-izq) (person-has person7 comida)
   goals met: 12 of 36
56. (move refugio34 deposito dron1)
   deleted: (at-dron dron1 refugio34)
   added: (at-dron dron1 deposito)
   goals met: 12 of 36
57. (pick box13 deposito dron1-izq dron1)
   deleted: (at-box box13 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box13)
   goals met: 12 of 36
58. (move deposito refugio34 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio34)
   goals met: 12 of 36
59. (leave box13 refugio34 dron1-izq dron1 person11 comida)
   deleted: (carrying dron1 dron1-izq box13) (box-has box13 comida)
   added: (at-box box13 refugio34) (free dron1-izq) (person-has person11 comida)
   goals met: 13 of 36
60. (move refugio34 deposito dron1)
   deleted: (at-dron dron1 refugio34)
   added: (at-dron dron1 deposito)
   goals met: 13 of 36
61. (pick box12 deposito dron1-izq dron1)
   deleted: (at-box box12 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box12)
   goals met: 13 of 36
62. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 13 of 36
63. (leave box12 refugio7 dron1-izq dron1 person2 comida)
   deleted: (carrying dron1 dron1-izq box12) (box-has box12 comida)
   added: (at-box box12 refugio7) (free dron1-izq) (person-has person2 comida)
   goals met: 14 of 36
64. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 14 of 36
65. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 14 of 36
66. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 14 of 36
67. (leave box11 refugio7 dron1-izq dron1 person15 comida)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 comida)
   added: (at-box box11 refugio7) (free dron1-izq) (person-has person15 comida)
   goals met: 15 of 36
68. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 15 of 36
69. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 15 of 36
70. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 15 of 36
71. (leave box29 refugio7 dron1-der dron1 person15 medicina)
   deleted: (carrying dron1 dron1-der box29) (box-has box29 medicina)
   added: (at-box box29 refugio7) (free dron1-der) (person-has person15 medicina)
   goals met: 16 of 36
72. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 16 of 36
73. (pick box28 deposito dron1-der dron1)
   deleted: (at-box box28 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box28)
   goals met: 16 of 36
74. (move deposito refugio33 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio33)
   goals met: 16 of 36
75. (leave box10 refugio33 dron1-izq dron1 person16 comida)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 comida)
   added: (at-box box10 refugio33) (free dron1-izq) (person-has person16 comida)
   goals met: 17 of 36
76. (move refugio33 deposito dron1)
   deleted: (at-dron dron1 refugio33)
   added: (at-dron dron1 deposito)
   goals met: 17 of 36
77. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 17 of 36
78. (move deposito refugio33 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio33)
   goals met: 17 of 36
79. (leave box28 refugio33 dron1-der dron1 person16 medicina)
   deleted: (carrying dron1 dron1-der box28) (box-has box28 medicina)
   added: (at-box box28 refugio33) (free dron1-der) (person-has person16 medicina)
   goals met: 18 of 36
80. (move refugio33 deposito dron1)
   deleted: (at-dron dron1 refugio33)
   added: (at-dron dron1 deposito)
   goals met: 18 of 36
81. (pick box27 deposito dron1-der dron1)
   deleted: (at-box box27 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box27)
   goals met: 18 of 36
82. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 18 of 36
83. (leave box9 refugio3 dron1-izq dron1 person1 comida)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 comida)
   added: (at-box box9 refugio3) (free dron1-izq) (person-has person1 comida)
   goals met: 19 of 36
84. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 19 of 36
85. (pick box8 deposito dron1-izq dron1)
   deleted: (at-box box8 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box8)
   goals met: 19 of 36
86. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 19 of 36
87. (leave box27 refugio3 dron1-der dron1 person1 medicina)
   deleted: (carrying dron1 dron1-der box27) (box-has box27 medicina)
   added: (at-box box27 refugio3) (free dron1-der) (person-has person1 medicina)
   goals met: 20 of 36
88. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 20 of 36
89. (pick box26 deposito dron1-der dron1)
   deleted: (at-box box26 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box26)
   goals met: 20 of 36
90. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 20 of 36
91. (leave box8 refugio3 dron1-izq dron1 person8 comida)
   deleted: (carrying dron1 dron1-izq box8) (box-has box8 comida)
   added: (at-box box8 refugio3) (free dron1-izq) (person-has person8 comida)
   goals met: 21 of 36
92. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 21 of 36
93. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 21 of 36
94. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 21 of 36
95. (leave box26 refugio3 dron1-der dron1 person8 medicina)
   deleted: (carrying dron1 dron1-der box26) (box-has box26 medicina)
   added: (at-box box26 refugio3) (free dron1-der) (person-has person8 medicina)
   goals met: 22 of 36
96. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 22 of 36
97. (pick box25 deposito dron1-der dron1)
   deleted: (at-box box25 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box25)
   goals met: 22 of 36
98. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 22 of 36
99. (leave box7 refugio3 dron1-izq dron1 person22 comida)
   deleted: (carrying dron1 dron1-izq box7) (box-has box7 comida)
   added: (at-box box7 refugio3) (free dron1-izq) (person-has person22 comida)
   goals met: 23 of 36
100. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 23 of 36
101. (pick box6 deposito dron1-izq dron1)
   deleted: (at-box box6 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box6)
   goals met: 23 of 36
102. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 23 of 36
103. (leave box25 refugio3 dron1-der dron1 person22 medicina)
   deleted: (carrying dron1 dron1-der box25) (box-has box25 medicina)
   added: (at-box box25 refugio3) (free dron1-der) (person-has person22 medicina)
   goals met: 24 of 36
104. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 24 of 36
105. (pick box24 deposito dron1-der dron1)
   deleted: (at-box box24 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box24)
   goals met: 24 of 36
106. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 24 of 36
107. (leave box24 refugio19 dron1-der dron1 person12 medicina)
   deleted: (carrying dron1 dron1-der box24) (box-has box24 medicina)
   added: (at-box box24 refugio19) (free dron1-der) (person-has person12 medicina)
   goals met: 25 of 36
108. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 25 of 36
109. (pick box23 deposito dron1-der dron1)
   deleted: (at-box box23 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box23)
   goals met: 25 of 36
110. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 25 of 36
111. (leave box6 refugio19 dron1-izq dron1 person24 comida)
   deleted: (carrying dron1 dron1-izq box6) (box-has box6 comida)
   added: (at-box box6 refugio19) (free dron1-izq) (person-has person24 comida)
   goals met: 26 of 36
112. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 26 of 36
113. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 26 of 36
114. (move deposito refugio18 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio18)
   goals met: 26 of 36
115. (leave box23 refugio18 dron1-der dron1 person4 medicina)
   deleted: (carrying dron1 dron1-der box23) (box-has box23 medicina)
   added: (at-box box23 refugio18) (free dron1-der) (person-has person4 medicina)
   goals met: 27 of 36
116. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 27 of 36
117. (pick box22 deposito dron1-der dron1)
   deleted: (at-box box22 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box22)
   goals met: 27 of 36
118. (move deposito refugio18 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio18)
   goals met: 27 of 36
119. (leave box5 refugio18 dron1-izq dron1 person27 comida)
   deleted: (carrying dron1 dron1-izq box5) (box-has box5 comida)
   added: (at-box box5 refugio18) (free dron1-izq) (person-has person27 comida)
   goals met: 28 of 36
120. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 28 of 36
121. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 28 of 36
122. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 28 of 36
123. (leave box22 refugio8 dron1-der dron1 person23 medicina)
   deleted: (carrying dron1 dron1-der box22) (box-has box22 medicina)
   added: (at-box box22 refugio8) (free dron1-der) (person-has person23 medicina)
   goals met: 29 of 36
124. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 29 of 36
125. (pick box21 deposito dron1-der dron1)
   deleted: (at-box box21 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box21)
   goals met: 29 of 36
126. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 29 of 36
127. (leave box4 refugio8 dron1-izq dron1 person26 comida)
   deleted: (carrying dron1 dron1-izq box4) (box-has box4 comida)
   added: (at-box box4 refugio8) (free dron1-izq) (person-has person26 comida)
   goals met: 30 of 36
128. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 30 of 36
129. (pick box3 deposito dron1-izq dron1)
   deleted: (at-box box3 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box3)
   goals met: 30 of 36
130. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 30 of 36
131. (leave box21 refugio8 dron1-der dron1 person26 medicina)
   deleted: (carrying dron1 dron1-der box21) (box-has box21 medicina)
   added: (at-box box21 refugio8) (free dron1-der) (person-has person26 medicina)
   goals met: 31 of 36
132. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 31 of 36
133. (pick box20 deposito dron1-der dron1)
   deleted: (at-box box20 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box20)
   goals met: 31 of 36
134. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 31 of 36
135. (leave box3 refugio8 dron1-izq dron1 person30 comida)
   deleted: (carrying dron1 dron1-izq box3) (box-has box3 comida)
   added: (at-box box3 refugio8) (free dron1-izq) (person-has person30 comida)
   goals met: 32 of 36
136. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 32 of 36
137. (pick box2 deposito dron1-izq dron1)
   deleted: (at-box box2 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box2)
   goals met: 32 of 36
138. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 32 of 36
139. (leave box20 refugio8 dron1-der dron1 person30 medicina)
   deleted: (carrying dron1 dron1-der box20) (box-has box20 medicina)
   added: (at-box box20 refugio8) (free dron1-der) (person-has person30 medicina)
   goals met: 33 of 36
140. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 33 of 36
141. (pick box19 deposito dron1-der dron1)
   deleted: (at-box box19 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box19)
   goals met: 33 of 36
142. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 33 of 36
143. (leave box19 refugio23 dron1-der dron1 person21 medicina)
   deleted: (carrying dron1 dron1-der box19) (box-has box19 medicina)
   added: (at-box box19 refugio23) (free dron1-der) (person-has person21 medicina)
   goals met: 34 of 36
144. (leave box2 refugio23 dron1-izq dron1 person21 comida)
   deleted: (carrying dron1 dron1-izq box2) (box-has box2 comida)
   added: (at-box box2 refugio23) (free dron1-izq) (person-has person21 comida)
   goals met: 35 of 36
145. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 35 of 36
146. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 35 of 36
147. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 35 of 36
148. (leave box1 refugio23 dron1-der dron1 person35 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio23) (free dron1-der) (person-has person35 comida)
   goals met: 36 of 36
